---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.IsCanceled
source: html/31f0b662-81a1-89b8-ab2a-0de99af3b753.htm
---
# Autodesk.Revit.DB.IExportContext.IsCanceled Method

This method is queried at the beginning of every element.

## Syntax (C#)
```csharp
bool IsCanceled()
```

## Returns
Return True if you wish to cancel the exporting process, or False otherwise.